---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurveArrArrayIterator
source: html/8ee20cad-4b85-fc4b-272c-01440e8a076a.htm
---
# CurveArrArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.